Delans-TLE/src/Enums/ОбработчикиДрайверовПодключаемогоОборудования/ОбработчикиДрайверовПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиДрайверовПодключаемогоОборудования</name>
  <enumValues>
    <name>Обработчик1СWebСервисОборудование</name>
    <comment>WebСервисОборудование</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СДисплейПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СККМOffline</name>
    <comment>ККМОфлайн</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СПринтерЧеков</name>
    <comment>ПринтерЧеков</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыМебиус</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СРарусФискальныеРегистраторыФеликс</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкодаNative</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКартNative</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СФискальныйРегистраторЭмулятор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СЭвоторККМOffline</name>
    <comment>ККМОфлайн</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СЭквайринговыеТерминалыСбербанк</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикACOMВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикARSККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикCASЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикERFIDСчитывательRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикFITККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIboxProПоддержкаMPosЭквайринга</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикISBCСчитывательRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикMPos2canЭквайринг</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикMSTARККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикNEWTONККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикPOSUAДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикRightScanТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикSKAM1CЭквайринговыеСистемы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикTRPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАТОЛВесыСПечатьюЭтикеток8X</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя8X</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККМOffline</name>
    <comment>ККМОфлайн</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККТ54ФЗ10X</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККТ54ФЗ9X</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода8X</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт8X</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторы8X</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы8X</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикВерсияТK1Ф54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикВерсияТФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикГексагонТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикДримкасККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИнитпроККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИскраККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикИскраФискальныеРегистраторыПрим</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсСчитывателиRFID</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисДисплеиПокупателяVikiVision</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикМассаКЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикОРИОНФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикРБСВесыCПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСБРФЭквайринговыеТерминалы</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодДисплеиПокупателяNative</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодПринтераЭтикетокGodexEZPL8Native</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСчитывательRFIDCipherLab</name>
    <comment>СчитывательRFID</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанныхNative</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиПринтераЭтикеток</name>
    <comment>ПринтерЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиТерминалСбораДанныхCitySoftBusiness</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСчетмашККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМВесыСПечатьюЭтикетокШтрихПринт</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККМOffline</name>
    <comment>ККМОфлайн</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККТ54ФЗ</name>
    <comment>ККТ</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМПлатежныйТерминалYarus</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторы</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМФискальныеРегистраторыУниверсальный</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМЭлектронныеВесыPOS2</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/CommonModules/МенеджерОборудованияКлиентПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
Функция ДатаСеанса() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера  - Перечисление, ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево, признак, что драйвер загружаемый
//  ТипОборудованияИмя  - Строка, представление типа оборудования
//
// Возвращаемое значение:
//  Результат - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт

// Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
#Если ВебКлиент Тогда
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
#Иначе
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
#КонецЕсли
	
	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
		
		// Считыватели магнитных карт
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССчитывателиМагнитныхКарт") Тогда
			Возврат ПодключаемоеОборудование1ССчитывателиМагнитныхКартКлиент;
		КонецЕсли;
		// Конец Считыватели магнитных карт.
		
	        // Весы с печатью этикеток
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикACOMВесыСПечатьюЭтикеток") Тогда
			Возврат ПодключаемоеОборудованиеACOMВесыСПечатьюЭтикетокКлиент;
		КонецЕсли;
		// Конец Весы с печатью этикеток.
	
		// ККМ Офлайн
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККМOffline") Тогда
			Возврат ОфлайнОборудованиеАтолККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМККМOffline") Тогда
			Возврат ОфлайнОборудованиеШтрихМККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СККМOffline") Тогда
			Возврат ОфлайнОборудование1СККМКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СЭвоторККМOffline") Тогда
			Возврат ОфлайнОборудование1СЭвоторКлиент;
		КонецЕсли;
		// Конец ККМ Офлайн
		
		// Web-сервис оборудование
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование") Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Конец Web-сервис оборудование
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	РассылкаЭлектронныхЧековКлиент.НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер);
	
КонецПроцедуры

// Начинает рассылку или ставит задачу на рассылку нефискальных документов.
// Которые заданы в шаблоне чека.
Процедура НачатьРассылкуНефискальныхДокументов(Параметры) Экспорт
	
КонецПроцедуры

// Переопределяет формируемый шаблон чека.
Функция СформироватьШаблонЧека(ВходныеПараметры, ДополнительныйТекст, СтандартнаяОбработка, ТипОборудования = "") Экспорт

КонецФункции

Процедура НачатьПодключениеОборудованиеПриОткрытииФормы(Форма, ВидОборудования) Экспорт
	Если МенеджерОборудованияВызовСервераПереопределяемый.ИспользуетсяОборудование(ВидОборудования) Тогда
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключениеОборудованиеЗавершение", ЭтотОбъект, Новый Структура("Форма", Форма));
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещенияПриПодключении, Форма, ВидОборудования);
	КонецЕсли;
КонецПроцедуры

Процедура НачатьОтключениеОборудованиеПриЗакрытииФормы(Форма) Экспорт
	Если Форма.ИспользоватьПодключаемоеОборудование Тогда
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ОтключениеОборудованиеЗавершение", ЭтотОбъект, Новый Структура("Форма", Форма));
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(ОповещенияПриПодключении, Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ПодключениеОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключениеОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 
#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаНавигационнойСсылки".
//
Процедура ЭкземплярОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
	// Доступ к узлу есть только для соответствующего оборудования.
	ЭтаФорма.Элементы.ПравилоОбмена.Видимость = Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМОфлайн")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.УдалитьWebСервисОборудование");
	
КонецПроцедуры

#КонецОбласти
